[
  {
    "type": "group",
    "label": {
      "en": "Device Settings",
      "de": "Geräteeinstellungen",
      "nl": "Apparaatinstellingen",
      "da": "Enhedsindstillinger",
      "fr": "Paramètres de l'appareil",
      "it": "Impostazioni del dispositivo",
      "ko": "장치 설정",
      "no": "Enhetsinnstillinger",
      "pl": "Ustawienia urządzenia",
      "ru": "Настройки устройства",
      "sv": "Enhetsinställningar",
      "es": "Configuración del dispositivo"
    },
    "children": [
      {
        "id": "base_url",
        "type": "text",
        "label": {
            "en": "PiHole base URL. Starts with http or https, and includes the port number if it differs from the default port.",
            "de": "PiHole-Basis-URL. Beginnt mit http oder https und enthält die Portnummer, falls diese vom Standardport abweicht.",
            "nl": "PiHole basis-URL. Begint met http of https en bevat het poortnummer als dit afwijkt van de standaardpoort.",
            "da": "PiHole basis-URL. Starter med http eller https og inkluderer portnummeret, hvis det adskiller sig fra standardporten.",
            "fr": "URL de base de PiHole. Commence par http ou https et inclut le numéro de port s'il diffère du port par défaut.",
            "it": "URL di base di PiHole. Inizia con http o https e include il numero di porta se diverso dalla porta predefinita.",
            "ko": "PiHole 기본 URL. http 또는 https로 시작하며 기본 포트와 다른 경우 포트 번호를 포함합니다.",
            "no": "PiHole basis-URL. Starter med http eller https og inkluderer portnummeret hvis det avviker fra standardporten.",
            "pl": "Podstawowy URL PiHole. Zaczyna się od http lub https i zawiera numer portu, jeśli różni się od portu domyślnego.",
            "ru": "Базовый URL PiHole. Начинается с http или https и включает номер порта, если он отличается от порта по умолчанию.",
            "sv": "PiHole bas-URL. Börjar med http eller https och inkluderar portnumret om det skiljer sig från standardporten.",
            "es": "URL base de PiHole. Comienza con http o https e incluye el número de puerto si difiere del puerto predeterminado."
        },
        "value": "",
        "hint": {
            "en": "Please use FQDN or IP address with prepended HTTP(s)!",
            "de": "Bitte verwenden Sie FQDN oder IP-Adresse mit vorangestelltem HTTP(s)!",
            "nl": "Gebruik alstublieft een FQDN of IP-adres met voorafgaand HTTP(s)!",
            "da": "Brug venligst FQDN eller IP-adresse med foranstillet HTTP(s)!",
            "fr": "Veuillez utiliser un FQDN ou une adresse IP avec HTTP(s) préfixé !",
            "it": "Si prega di utilizzare un FQDN o un indirizzo IP con HTTP(s) anteposto!",
            "ko": "HTTP(s)가 앞에 붙은 FQDN 또는 IP 주소를 사용하세요!",
            "no": "Vennligst bruk FQDN eller IP-adresse med påført HTTP(s)!",
            "pl": "Proszę użyć FQDN lub adresu IP z poprzedzonym HTTP(s)!",
            "ru": "Пожалуйста, используйте FQDN или IP-адрес с добавленным HTTP(s)!",
            "sv": "Använd vänligen FQDN eller IP-adress med tillagt HTTP(s)!",
            "es": "Por favor, utilice un FQDN o una dirección IP con HTTP(s) antepuesto."
        }
      },
      {
        "id": "api_password",
        "type": "text",
        "label": {
            "en": "API password",
            "de": "API-Passwort",
            "nl": "API-wachtwoord",
            "da": "API-adgangskode",
            "fr": "Mot de passe API",
            "it": "Password API",
            "ko": "API 비밀번호",
            "no": "API-passord",
            "pl": "Hasło API",
            "ru": "Пароль API",
            "sv": "API-lösenord",
            "es": "Contraseña de API"
        },
        "hint": {
            "en": "Please enter the PiHole API password here. This is the password you use to login, or an app-password if you enabled 2-factor authentication.",
            "de": "Bitte geben Sie hier das PiHole-API-Passwort ein. Dies ist das Passwort, das Sie zum Anmelden verwenden, oder ein App-Passwort, wenn Sie die Zwei-Faktor-Authentifizierung aktiviert haben.",
            "nl": "Voer hier het PiHole API-wachtwoord in. Dit is het wachtwoord dat u gebruikt om in te loggen, of een app-wachtwoord als u tweefactorauthenticatie hebt ingeschakeld.",
            "da": "Indtast venligst PiHole API-adgangskoden her. Dette er adgangskoden, du bruger til at logge ind, eller en app-adgangskode, hvis du har aktiveret tofaktorgodkendelse.",
            "fr": "Veuillez entrer le mot de passe API de PiHole ici. C'est le mot de passe que vous utilisez pour vous connecter, ou un mot de passe d'application si vous avez activé l'authentification à deux facteurs.",
            "it": "Inserisci qui la password API di PiHole. Questa è la password che usi per accedere o una password per app se hai abilitato l'autenticazione a due fattori.",
            "ko": "여기에 PiHole API 비밀번호를 입력하세요. 로그인에 사용하는 비밀번호이거나 2단계 인증을 활성화한 경우 앱 비밀번호입니다.",
            "no": "Vennligst skriv inn PiHole API-passordet her. Dette er passordet du bruker for å logge inn, eller et app-passord hvis du har aktivert tofaktorautentisering.",
            "pl": "Proszę wprowadzić tutaj hasło API PiHole. Jest to hasło, którego używasz do logowania, lub hasło aplikacji, jeśli włączyłeś uwierzytelnianie dwuskładnikowe.",
            "ru": "Пожалуйста, введите здесь пароль API PiHole. Это пароль, который вы используете для входа, или пароль приложения, если вы включили двухфакторную аутентификацию.",
            "sv": "Ange PiHole API-lösenordet här. Detta är lösenordet du använder för att logga in, eller ett app-lösenord om du har aktiverat tvåfaktorsautentisering.",
            "es": "Por favor, introduzca aquí la contraseña de la API de PiHole. Esta es la contraseña que utiliza para iniciar sesión, o una contraseña de aplicación si ha habilitado la autenticación de dos factores."
        },
        "value": ""
      }
    ]
  },
  {
    "type": "group",
    "label": {
      "en": "Update Interval",
      "de": "Aktualisierungsintervall",
      "nl": "Update-interval",
      "da": "Opdateringsinterval",
      "fr": "Intervalle de mise à jour",
      "it": "Intervallo di aggiornamento",
      "ko": "업데이트 간격",
      "no": "Oppdateringsintervall",
      "pl": "Interwał aktualizacji",
      "ru": "Интервал обновления",
      "sv": "Uppdateringsintervall",
      "es": "Intervalo de actualización"
    },
    "children": [
      {
        "id": "update_interval_seconds",
        "type": "text",
        "label": {
            "en": "Fetch Interval (in seconds)",
            "de": "Abrufintervall (in Sekunden)",
            "nl": "Ophaalinterval (in seconden)",
            "da": "Hentningsinterval (i sekunder)",
            "fr": "Intervalle de récupération (en secondes)",
            "it": "Intervallo di recupero (in secondi)",
            "ko": "가져오기 간격(초)",
            "no": "Henteintervall (i sekunder)",
            "pl": "Interwał pobierania (w sekundach)",
            "ru": "Интервал выборки (в секундах)",
            "sv": "Hämtningsintervall (i sekunder)",
            "es": "Intervalo de obtención (en segundos)"
          },
        "hint": {
            "en": "Choose an update interval. Select an interval of up to 10 mins to enable live updates from the device.",
            "de": "Wählen Sie ein Aktualisierungsintervall. Wählen Sie ein Intervall von bis zu 10 Minuten, um Live-Updates vom Gerät zu aktivieren.",
            "nl": "Kies een update-interval. Selecteer een interval van maximaal 10 minuten om live-updates van het apparaat in te schakelen.",
            "da": "Vælg et opdateringsinterval. Vælg et interval på op til 10 minutter for at aktivere liveopdateringer fra enheden.",
            "fr": "Choisissez un intervalle de mise à jour. Sélectionnez un intervalle allant jusqu'à 10 minutes pour activer les mises à jour en direct depuis l'appareil.",
            "it": "Scegli un intervallo di aggiornamento. Seleziona un intervallo fino a 10 minuti per abilitare gli aggiornamenti in tempo reale dal dispositivo.",
            "ko": "업데이트 간격을 선택하세요. 장치에서 실시간 업데이트를 활성화하려면 최대 10분 간격을 선택하세요.",
            "no": "Velg et oppdateringsintervall. Velg et intervall på opptil 10 minutter for å aktivere sanntidsoppdateringer fra enheten.",
            "pl": "Wybierz interwał aktualizacji. Wybierz interwał do 10 minut, aby włączyć aktualizacje na żywo z urządzenia.",
            "ru": "Выберите интервал обновления. Выберите интервал до 10 минут, чтобы включить обновления в реальном времени с устройства.",
            "sv": "Välj ett uppdateringsintervall. Välj ett intervall på upp till 10 minuter för att aktivera liveuppdateringar från enheten.",
            "es": "Elija un intervalo de actualización. Seleccione un intervalo de hasta 10 minutos para habilitar actualizaciones en vivo desde el dispositivo."
        },
        "min": 3,
        "value": "15"
      }
    ]
  }
]